## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_subnet.nodepool-sn will be destroyed
  # (because azurerm_subnet.nodepool-sn is not in configuration)
  - resource "azurerm_subnet" "nodepool-sn" {
      - address_prefixes                              = [
          - "10.1.0.0/16",
        ] -> null
      - default_outbound_access_enabled               = true -> null
      - id                                            = "/subscriptions/26b831cd-373c-4fa1-8009-af147456a2c5/resourceGroups/Terraform-workshops/providers/Microsoft.Network/virtualNetworks/lorenzo-prd-vn/subnets/nodepool-sn" -> null
      - name                                          = "nodepool-sn" -> null
      - private_endpoint_network_policies             = "Disabled" -> null
      - private_link_service_network_policies_enabled = true -> null
      - resource_group_name                           = "Terraform-workshops" -> null
      - virtual_network_name                          = "lorenzo-prd-vn" -> null
    }

  # azurerm_virtual_network.vn must be replaced
-/+ resource "azurerm_virtual_network" "vn" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "5116accc-fe82-4cac-a854-2577a0ebe712" -> (known after apply)
      ~ id                      = "/subscriptions/26b831cd-373c-4fa1-8009-af147456a2c5/resourceGroups/Terraform-workshops/providers/Microsoft.Network/virtualNetworks/lorenzo-prd-vn" -> (known after apply)
      ~ name                    = "lorenzo-prd-vn" -> "lorenzo-dev-vn" # forces replacement
      ~ subnet                  = [
          - {
              - address_prefixes                              = [
                  - "10.1.0.0/16",
                ]
              - default_outbound_access_enabled               = true
              - delegation                                    = []
              - id                                            = "/subscriptions/26b831cd-373c-4fa1-8009-af147456a2c5/resourceGroups/Terraform-workshops/providers/Microsoft.Network/virtualNetworks/lorenzo-prd-vn/subnets/nodepool-sn"
              - name                                          = "nodepool-sn"
              - private_endpoint_network_policies             = "Disabled"
              - private_link_service_network_policies_enabled = true
              - service_endpoint_policy_ids                   = []
              - service_endpoints                             = []
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      - tags                    = {} -> null
        # (5 unchanged attributes hidden)
    }

  # module.aks.data.azurerm_resource_group.rg-tfworkshops will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "rg-tfworkshops" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "Terraform-workshops"
      + tags       = (known after apply)
    }

  # module.aks.data.azurerm_virtual_network.vn will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "vn" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "lorenzo-dev-vn"
      + resource_group_name     = "Terraform-workshops"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "lorenzo-dev"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "lorenzo-dev-aks"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "Terraform-workshops"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v3"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile (known after apply)

      + windows_profile (known after apply)
    }

  # module.aks.azurerm_subnet.nodepool-sn will be created
  + resource "azurerm_subnet" "nodepool-sn" {
      + address_prefixes                              = [
          + "10.1.0.0/16",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "nodepool-sn"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "Terraform-workshops"
      + virtual_network_name                          = "lorenzo-dev-vn"
    }

  # module.postgres.data.azurerm_resource_group.rg-tfworkshops will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "rg-tfworkshops" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "Terraform-workshops"
      + tags       = (known after apply)
    }

  # module.postgres.data.azurerm_virtual_network.vn will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "vn" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "lorenzo-dev-vn"
      + resource_group_name     = "Terraform-workshops"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.postgres.azurerm_postgresql_flexible_server.postgres will be created
  + resource "azurerm_postgresql_flexible_server" "postgres" {
      + administrator_login           = "psqladmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = true
      + backup_retention_days         = (known after apply)
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = (known after apply)
      + name                          = "lorenzo-dev-postgres"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "Terraform-workshops"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = "P4"
      + version                       = "16"
      + zone                          = "1"

      + authentication (known after apply)
    }

  # module.postgres.azurerm_private_dns_zone.postgres-dns-zone will be created
  + resource "azurerm_private_dns_zone" "postgres-dns-zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "lorenzo.dev.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "Terraform-workshops"

      + soa_record (known after apply)
    }

  # module.postgres.azurerm_private_dns_zone_virtual_network_link.postgres-dns-zone-link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "postgres-dns-zone-link" {
      + id                    = (known after apply)
      + name                  = "lorenzo-dev-vnet-postgres-link"
      + private_dns_zone_name = "lorenzo.dev.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "Terraform-workshops"
      + virtual_network_id    = (known after apply)
    }

  # module.postgres.azurerm_subnet.postgres-sn will be created
  + resource "azurerm_subnet" "postgres-sn" {
      + address_prefixes                              = [
          + "10.2.0.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "postgres-sn"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "Terraform-workshops"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "lorenzo-dev-vn"

      + delegation {
          + name = "fs"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

Plan: 7 to add, 0 to change, 2 to destroy.
```
</details>